<script setup>
import Leaf from "./LeafsBlock/Leaf.vue";
import LeafTextBlock from "./LeafsBlock/LeafTextBlock.vue";
import {ref} from "vue";

const leafs = [
    {
        'image': 'images/leaves/teatralnaya_studia.png',
        'title': 'Театральная студия 10+',
        'textBlocks': [
            {
                title: 'Основная информация',
                text: 'У нас можно дурачиться, общаться, увлекаться, создавать, пробовать и фантазировать. В приоритете показать и раскрыть, что внутри каждого есть творец, который может создавать удивительные миры. \n' +
                    'На занятиях мы знакомимся с различными театральными направлениями, прокачиваем воображение, внимание, умение держаться на публике, выражать свои мысли, soft skills. \n' +
                    '\n',
            },
            {
                title: 'Правила приема',
                text: 'Не важен уровень подготовки. Главное - это желание заниматься и творить!\n' +
                    'P.s. для продолжающих есть отдельная группа, где занятия идут более углубленно, туда можно попасть на усмотрение педагога из основной группы\n' +
                    '\n',
            },
            {
                title: 'Место расположения',
                text: 'ст. метро Калужская\n' +
                    'Культурный центр “Меридиан”\n' +
                    'ул. Профсоюзная, 61',
            },
            {
                title: 'Расписание\n',
                text: '10 — 12 лет   СР 16:00 – 17:00' +
                    'СБ 10:30 – 11:30' +
                    '13 — 17 лет  СР 17:00 – 18:00' +
                    'СБ 11:30 – 12:30',
            },
            {
                title: 'Стоимость (продолжительность) занятий ',
                text: 'Культурный центр “Меридиан”' +
                    'Разовое занятие – 800 руб. (1 час)' +
                    '8 занятий – 4080 руб.',
            },
        ]
    },
    {
        'image': 'images/leaves/acterskie_kursi.png',
        'title': 'Актерские курсы 18+',
        'textBlocks': [
            {
                title: 'Основная информация',
                text: 'Если Вы давно хотели попробовать себя в роли актера, побывать в творческой атмосфере и раскрыть себя с новой стороны, то актерские курсы для Вас! \n' +
                    'На занятиях царит атмосфера свободы и самовыражения. \n' +
                    'Главная задача - открыть своего внутреннего творца и позволить себе на некоторое время забыть о невзгодах и проблемах, что поджидают снаружи. \n' +
                    'Раскрытие своего потенциала через творческое начало — это важный шаг к себе. Созидание открывает новые возможности и расширяет кругозор, поэтому актерское мастерство будет полезно не только в качестве хобби, но и станет важным подспорьем в жизни. На тренингах мы будем развивать коммуникативные навыки, прокачивать эмоциональный интеллект, учиться снимать мышечные зажимы, как справляться с волнением и страхом публичного выступления.\n' +
                    'В конце курса будет представлена отчетная постановка, которая позволит почувствовать себя настоящим актером! ',
            },
            {
                title: 'Правила приема',
                text: 'Нет кастингов и вступительных испытаний, набор открыт для всех желающих от 18 лет. . Количество мест в группах ограниченно, набираем 15-20 человек, чтобы создать комфортную и рабочую атмосферу. Для тренингов необходима одежда спортивного типа и удобная обувь.\n'
            },
            {
                title: 'Место расположения',
                text: 'ст. метро Калужская\n' +
                    'Культурный центр “Меридиан”\n' +
                    'ул. Профсоюзная, 61',
            },
            {
                title: 'Расписание\n',
                text: '10 — 12 лет   СР 16:00 – 17:00' +
                    'СБ 10:30 – 11:30' +
                    '13 — 17 лет  СР 17:00 – 18:00' +
                    'СБ 11:30 – 12:30',
            },
            {
                title: 'Стоимость (продолжительность) занятий ',
                text: 'Культурный центр “Меридиан”' +
                    'Разовое занятие – 800 руб. (1 час)' +
                    '8 занятий – 4080 руб.',
            },
        ]
    },
    {
        'image': 'images/leaves/akterskie_intensivi.png',
        'title': 'Актерские интенсивы',
        'textBlocks': [
            {
                text: '1',
            },
            {
                text: '2',
            },
            {
                text: '3',
            },
        ]
    },
    {
        'image': 'images/leaves/akterskie_intensivi.png',
        'title': 'Мои проекты',
        'textBlocks': [
            {
                title: '1',
                text: '1',
            },
            {
                text: '2',
            },
            {
                text: '3',
            },
            {
                text: '4',
            },
        ]
    }
]

const selectedTextBlockId = ref(0);
const isVisible = ref(false);

function showTextBlock(index) {
    isVisible.value = true;
    selectedTextBlockId.value = index;
}
</script>

<template>

    <div class="bg-cover bg-no-repeat cloud" :style="{ backgroundImage: `url(images/cloud_bg.png)` }">
        <div class="relative flex justify-evenly">
            <leaf v-for="(leaf, i) in leafs"
                  :key="i"
                  :title="leaf.title"
                  :image="leaf.image"
                  @click="showTextBlock(i)"
            >
            </leaf>
        </div>
    </div>
    <leaf-text-block
        v-if="isVisible"
        :text-blocks="leafs[selectedTextBlockId].textBlocks"
    />

</template>

<style scoped>

</style>
